; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	thermograph1 - mode
	infrared2 - mode
	spectrograph0 - mode
	infrared3 - mode
	Star6 - direction
	GroundStation7 - direction
	Star10 - direction
	Star19 - direction
	GroundStation27 - direction
	Star0 - direction
	Star12 - direction
	Star20 - direction
	GroundStation29 - direction
	Star22 - direction
	GroundStation15 - direction
	GroundStation24 - direction
	GroundStation21 - direction
	Star23 - direction
	GroundStation25 - direction
	GroundStation17 - direction
	GroundStation16 - direction
	Star2 - direction
	Star1 - direction
	GroundStation28 - direction
	Star13 - direction
	Star18 - direction
	Star26 - direction
	GroundStation11 - direction
	GroundStation8 - direction
	Star3 - direction
	Star9 - direction
	GroundStation14 - direction
	GroundStation5 - direction
	Star4 - direction
	Phenomenon30 - direction
	Star31 - direction
	Planet32 - direction
	Phenomenon33 - direction
	Star34 - direction
	Phenomenon35 - direction
	Phenomenon36 - direction
	Star37 - direction
	Phenomenon38 - direction
	Planet39 - direction
	Star40 - direction
	Planet41 - direction
	Planet42 - direction
	Phenomenon43 - direction
	Phenomenon44 - direction
	Phenomenon45 - direction
	Phenomenon46 - direction
	Phenomenon47 - direction
	Phenomenon48 - direction
	Phenomenon49 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 thermograph1)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star20)
	(calibration_target instrument0 GroundStation25)
	(calibration_target instrument0 GroundStation17)
	(calibration_target instrument0 GroundStation24)
	(calibration_target instrument0 GroundStation16)
	(calibration_target instrument0 GroundStation11)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 Star12)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared2)
	(supports instrument1 infrared3)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation25)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation21)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation11)
	(calibration_target instrument1 GroundStation15)
	(calibration_target instrument1 Star22)
	(calibration_target instrument1 GroundStation29)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation14)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation25)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 Star23)
	(calibration_target instrument2 GroundStation21)
	(calibration_target instrument2 GroundStation24)
	(calibration_target instrument2 GroundStation15)
	(calibration_target instrument2 GroundStation17)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument3 infrared3)
	(supports instrument3 infrared2)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 Star26)
	(calibration_target instrument3 Star13)
	(calibration_target instrument3 GroundStation28)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 GroundStation14)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation16)
	(calibration_target instrument3 GroundStation8)
	(calibration_target instrument3 GroundStation17)
	(supports instrument4 spectrograph0)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation14)
	(calibration_target instrument4 Star9)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 GroundStation11)
	(calibration_target instrument4 Star26)
	(calibration_target instrument4 Star18)
	(supports instrument5 infrared3)
	(supports instrument5 thermograph1)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon30)
)
(:goal (and
	(pointing satellite0 GroundStation14)
	(have_image Phenomenon30 infrared3)
	(have_image Star31 thermograph1)
	(have_image Planet32 thermograph1)
	(have_image Phenomenon33 thermograph1)
	(have_image Star34 infrared2)
	(have_image Phenomenon35 infrared3)
	(have_image Phenomenon36 infrared3)
	(have_image Star37 spectrograph0)
	(have_image Phenomenon38 infrared3)
	(have_image Planet39 infrared2)
	(have_image Star40 thermograph1)
	(have_image Planet41 infrared3)
	(have_image Planet42 infrared2)
	(have_image Phenomenon43 infrared3)
	(have_image Phenomenon44 thermograph1)
	(have_image Phenomenon45 spectrograph0)
	(have_image Phenomenon46 spectrograph0)
	(have_image Phenomenon47 infrared3)
	(have_image Phenomenon48 infrared2)
	(have_image Phenomenon49 thermograph1)
))

)

; plan
1. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 1 of 21
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 21
3. (turn_to satellite2 star9 phenomenon30)
   deleted: (pointing satellite2 phenomenon30)
   added: (pointing satellite2 star9)
   goals met: 1 of 21
4. (calibrate satellite2 instrument3 star9)
   added: (calibrated instrument3)
   goals met: 1 of 21
5. (turn_to satellite2 phenomenon30 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 phenomenon30)
   goals met: 1 of 21
6. (take_image satellite2 phenomenon30 instrument3 infrared3)
   added: (have_image phenomenon30 infrared3)
   goals met: 2 of 21
7. (turn_to satellite2 phenomenon33 phenomenon30)
   deleted: (pointing satellite2 phenomenon30)
   added: (pointing satellite2 phenomenon33)
   goals met: 2 of 21
8. (take_image satellite2 phenomenon33 instrument3 thermograph1)
   added: (have_image phenomenon33 thermograph1)
   goals met: 3 of 21
9. (turn_to satellite2 phenomenon35 phenomenon33)
   deleted: (pointing satellite2 phenomenon33)
   added: (pointing satellite2 phenomenon35)
   goals met: 3 of 21
10. (take_image satellite2 phenomenon35 instrument3 infrared3)
   added: (have_image phenomenon35 infrared3)
   goals met: 4 of 21
11. (turn_to satellite2 phenomenon36 phenomenon35)
   deleted: (pointing satellite2 phenomenon35)
   added: (pointing satellite2 phenomenon36)
   goals met: 4 of 21
12. (take_image satellite2 phenomenon36 instrument3 infrared3)
   added: (have_image phenomenon36 infrared3)
   goals met: 5 of 21
13. (turn_to satellite2 phenomenon38 phenomenon36)
   deleted: (pointing satellite2 phenomenon36)
   added: (pointing satellite2 phenomenon38)
   goals met: 5 of 21
14. (take_image satellite2 phenomenon38 instrument3 infrared3)
   added: (have_image phenomenon38 infrared3)
   goals met: 6 of 21
15. (turn_to satellite2 phenomenon43 phenomenon38)
   deleted: (pointing satellite2 phenomenon38)
   added: (pointing satellite2 phenomenon43)
   goals met: 6 of 21
16. (take_image satellite2 phenomenon43 instrument3 infrared3)
   added: (have_image phenomenon43 infrared3)
   goals met: 7 of 21
17. (turn_to satellite2 phenomenon44 phenomenon43)
   deleted: (pointing satellite2 phenomenon43)
   added: (pointing satellite2 phenomenon44)
   goals met: 7 of 21
18. (take_image satellite2 phenomenon44 instrument3 thermograph1)
   added: (have_image phenomenon44 thermograph1)
   goals met: 8 of 21
19. (turn_to satellite2 phenomenon47 phenomenon44)
   deleted: (pointing satellite2 phenomenon44)
   added: (pointing satellite2 phenomenon47)
   goals met: 8 of 21
20. (take_image satellite2 phenomenon47 instrument3 infrared3)
   added: (have_image phenomenon47 infrared3)
   goals met: 9 of 21
21. (turn_to satellite2 phenomenon48 phenomenon47)
   deleted: (pointing satellite2 phenomenon47)
   added: (pointing satellite2 phenomenon48)
   goals met: 9 of 21
22. (take_image satellite2 phenomenon48 instrument3 infrared2)
   added: (have_image phenomenon48 infrared2)
   goals met: 10 of 21
23. (turn_to satellite2 phenomenon49 phenomenon48)
   deleted: (pointing satellite2 phenomenon48)
   added: (pointing satellite2 phenomenon49)
   goals met: 10 of 21
24. (take_image satellite2 phenomenon49 instrument3 thermograph1)
   added: (have_image phenomenon49 thermograph1)
   goals met: 11 of 21
25. (turn_to satellite2 planet32 phenomenon49)
   deleted: (pointing satellite2 phenomenon49)
   added: (pointing satellite2 planet32)
   goals met: 11 of 21
26. (take_image satellite2 planet32 instrument3 thermograph1)
   added: (have_image planet32 thermograph1)
   goals met: 12 of 21
27. (turn_to satellite2 planet39 planet32)
   deleted: (pointing satellite2 planet32)
   added: (pointing satellite2 planet39)
   goals met: 12 of 21
28. (take_image satellite2 planet39 instrument3 infrared2)
   added: (have_image planet39 infrared2)
   goals met: 13 of 21
29. (turn_to satellite2 planet41 planet39)
   deleted: (pointing satellite2 planet39)
   added: (pointing satellite2 planet41)
   goals met: 13 of 21
30. (take_image satellite2 planet41 instrument3 infrared3)
   added: (have_image planet41 infrared3)
   goals met: 14 of 21
31. (turn_to satellite2 planet42 planet41)
   deleted: (pointing satellite2 planet41)
   added: (pointing satellite2 planet42)
   goals met: 14 of 21
32. (take_image satellite2 planet42 instrument3 infrared2)
   added: (have_image planet42 infrared2)
   goals met: 15 of 21
33. (turn_to satellite2 star31 planet42)
   deleted: (pointing satellite2 planet42)
   added: (pointing satellite2 star31)
   goals met: 15 of 21
34. (take_image satellite2 star31 instrument3 thermograph1)
   added: (have_image star31 thermograph1)
   goals met: 16 of 21
35. (turn_to satellite2 star34 star31)
   deleted: (pointing satellite2 star31)
   added: (pointing satellite2 star34)
   goals met: 16 of 21
36. (take_image satellite2 star34 instrument3 infrared2)
   added: (have_image star34 infrared2)
   goals met: 17 of 21
37. (turn_to satellite2 star40 star34)
   deleted: (pointing satellite2 star34)
   added: (pointing satellite2 star40)
   goals met: 17 of 21
38. (take_image satellite2 star40 instrument3 thermograph1)
   added: (have_image star40 thermograph1)
   goals met: 18 of 21
39. (turn_to satellite0 star3 groundstation14)
   deleted: (pointing satellite0 groundstation14)
   added: (pointing satellite0 star3)
   goals met: 17 of 21
40. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 17 of 21
41. (turn_to satellite0 groundstation14 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation14)
   goals met: 18 of 21
42. (turn_to satellite0 phenomenon45 groundstation14)
   deleted: (pointing satellite0 groundstation14)
   added: (pointing satellite0 phenomenon45)
   goals met: 17 of 21
43. (take_image satellite0 phenomenon45 instrument1 spectrograph0)
   added: (have_image phenomenon45 spectrograph0)
   goals met: 18 of 21
44. (turn_to satellite0 groundstation14 phenomenon45)
   deleted: (pointing satellite0 phenomenon45)
   added: (pointing satellite0 groundstation14)
   goals met: 19 of 21
45. (turn_to satellite0 phenomenon46 groundstation14)
   deleted: (pointing satellite0 groundstation14)
   added: (pointing satellite0 phenomenon46)
   goals met: 18 of 21
46. (take_image satellite0 phenomenon46 instrument1 spectrograph0)
   added: (have_image phenomenon46 spectrograph0)
   goals met: 19 of 21
47. (turn_to satellite0 groundstation14 phenomenon46)
   deleted: (pointing satellite0 phenomenon46)
   added: (pointing satellite0 groundstation14)
   goals met: 20 of 21
48. (turn_to satellite0 star37 groundstation14)
   deleted: (pointing satellite0 groundstation14)
   added: (pointing satellite0 star37)
   goals met: 19 of 21
49. (take_image satellite0 star37 instrument1 spectrograph0)
   added: (have_image star37 spectrograph0)
   goals met: 20 of 21
50. (turn_to satellite0 groundstation14 star37)
   deleted: (pointing satellite0 star37)
   added: (pointing satellite0 groundstation14)
   goals met: 21 of 21
